import { Question } from '../models/question.js';

export const questions: Question[] = [
  {
    question: "ما هو اسم النبي الذي بنى الكعبة؟",
    options: ["إبراهيم", "محمد", "عيسى", "موسى"],
    answer: "إبراهيم",
  },
  {
    question: "ما عاصمة المملكة العربية السعودية؟",
    options: ["الرياض", "جدة", "مكة", "الدمام"],
    answer: "الرياض",
  },
  {
    question: "كم عدد أركان الإسلام؟",
    options: ["3", "4", "5", "6"],
    answer: "5",
  },
  {
    question: "من هو أول الخلفاء الراشدين؟",
    options: ["عمر بن الخطاب", "عثمان بن عفان", "علي بن أبي طالب", "أبو بكر الصديق"],
    answer: "أبو بكر الصديق",
  },
  {
    question: "في أي قارة تقع مصر؟",
    options: ["آسيا", "أوروبا", "أفريقيا", "أمريكا الجنوبية"],
    answer: "أفريقيا",
  },
  {
    question: "كم عدد أحرف اللغة العربية؟",
    options: ["26", "28", "29", "30"],
    answer: "28",
  },
  {
    question: "من مخترع المصباح الكهربائي؟",
    options: ["إديسون", "نيوتن", "أينشتاين", "غراهام بيل"],
    answer: "إديسون",
  },

  {
    question: "ما اسم البحر الذي يفصل بين السعودية ومصر؟",
    options: ["البحر الأسود", "البحر الأحمر", "البحر المتوسط", "بحر قزوين"],
    answer: "البحر الأحمر",
  }
];
